spec/fixtures/stripe/stripe_checkout_session_customer_present.json

{
  "id": "cs_test_a1D2NebdAudpPiucybElBFWapFaucAX27qC1lOyp8rRoLHef40fLy5vV0g",
  "object": "checkout.session",
  "adaptive_pricing": { "enabled": false },
  "after_expiration": null,
  "allow_promotion_codes": null,
  "amount_subtotal": 300,
  "amount_total": 300,
  "automatic_tax": { "enabled": false, "liability": null, "status": null },
  "billing_address_collection": "auto",
  "cancel_url": "http://localhost:3000/order",
  "client_reference_id": null,
  "client_secret": null,
  "consent": null,
  "consent_collection": null,
  "created": 1731442456,
  "currency": "usd",
  "currency_conversion": null,
  "custom_fields": [],
  "custom_text": {
    "after_submit": null,
    "shipping_address": null,
    "submit": null,
    "terms_of_service_acceptance": null
  },
  "customer": "cus_RCb5X2SQYOwAKG",
  "customer_creation": null,
  "customer_details": {
    "address": {
      "city": "San Francisco",
      "country": "USA",
      "line1": "123 Main St",
      "line2": "Apt 567",
      "postal_code": "12355",
      "state": "UT"
    },
    "email": "dairytest@test.com",
    "name": "Dairy Test",
    "phone": null,
    "tax_exempt": "none",
    "tax_ids": []
  },
  "customer_email": null,
  "expires_at": 1731528856,
  "invoice": null,
  "invoice_creation": {
    "enabled": false,
    "invoice_data": {
      "account_tax_ids": null,
      "custom_fields": null,
      "description": null,
      "footer": null,
      "issuer": null,
      "metadata": {},
      "rendering_options": null
    }
  },
  "livemode": false,
  "locale": null,
  "metadata": {},
  "mode": "payment",
  "payment_intent": "pi_3QKQTfElA4InVgv80UIJyQHY",
  "payment_link": null,
  "payment_method_collection": "if_required",
  "payment_method_configuration_details": {
    "id": "pmc_1QKI6xElA4InVgv8AaZ4UKa9",
    "parent": null
  },
  "payment_method_options": {
    "card": { "request_three_d_secure": "automatic" }
  },
  "payment_method_types": ["card", "link", "cashapp", "amazon_pay"],
  "payment_status": "paid",
  "phone_number_collection": { "enabled": false },
  "recovered_from": null,
  "saved_payment_method_options": {
    "allow_redisplay_filters": ["always"],
    "payment_method_remove": null,
    "payment_method_save": "enabled"
  },
  "setup_intent": null,
  "shipping_address_collection": null,
  "shipping_cost": null,
  "shipping_details": null,
  "shipping_options": [],
  "status": "complete",
  "submit_type": null,
  "subscription": null,
  "success_url": "http://localhost:3000/success",
  "total_details": {
    "amount_discount": 0,
    "amount_shipping": 0,
    "amount_tax": 0
  },
  "ui_mode": "hosted",
  "url": null
}
